In [7]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
import pickle

In [8]:
dataset = pd.read_csv('hiring.csv')

In [9]:
dataset.head()

  experience  test_score  interview_score  salary
0        NaN         8.0                9   50000
1        NaN         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000

###Do Some Feature Engineering To Normalize the data and and remove all nan values and many more which is there in the data

In [10]:
dataset['experience'].fillna(0, inplace=True)

In [11]:
dataset.head()

  experience  test_score  interview_score  salary
0          0         8.0                9   50000
1          0         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000

In [12]:
dataset['test_score'].fillna(dataset['test_score'].mean(), inplace=True)

In [13]:
dataset.head()

  experience  test_score  interview_score  salary
0          0         8.0                9   50000
1          0         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000

In [14]:
X = dataset.iloc[:, :3]

###Converting words to integer values

In [15]:

def convert_to_int(word):
    word_dict = {'one':1, 'two':2, 'three':3, 'four':4, 'five':5, 'six':6, 'seven':7, 'eight':8,
                'nine':9, 'ten':10, 'eleven':11, 'twelve':12, 'zero':0, 0: 0}
    return word_dict[word]

In [16]:
X['experience'] = X['experience'].apply(lambda x : convert_to_int(x))

In [17]:
X.head()

   experience  test_score  interview_score
0           0         8.0                9
1           0         8.0                6
2           5         6.0                7
3           2        10.0               10
4           7         9.0                6

In [18]:
y = dataset.iloc[:, -1]

###Splitting Training and Test Set

###Since we have a very small dataset, we will train our model with all availabe data.

In [19]:
from sklearn.linear_model import LinearRegression
regressor = LinearRegression()

In [20]:
#Fitting model with trainig data
regressor.fit(X, y)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [22]:
# Saving model to disk
pickle.dump(regressor, open('linear-regression-model.pkl','wb'))

In [23]:
# Loading model to compare the results
model = pickle.load(open('linear-regression-model.pkl','rb'))
print(model.predict([[2, 9, 6]]))

[53290.89255945]